In [1]:
import pandas as pd 
url = 'https://bit.ly/3Tb15qr'

dataframe = pd.read_csv(url)

dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

3.1 데이터 프레임 만들기

In [2]:
import pandas as pd

dictionary = {
    "Name" :['Jacky Jackson' , 'Steven Stevenson'],
    "Age" :[38,25],
    "Driver":[True,False]
}

dataframe = pd.DataFrame(dictionary)

dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False